(function(){
	miData = {
		//starGoods
		starGoods:{
			imgSrc:['images/stargoods/1.png','images/stargoods/2.png','images/stargoods/3.png','images/stargoods/4.jpg','images/stargoods/5.png','images/stargoods/6.jpg','images/stargoods/7.jpg','images/stargoods/8.png','images/stargoods/9.jpg','images/stargoods/10.jpg'],
			titles : ['小米手机5 尊享版' , '小米Max 高配版' , '红米手机3S', '小米平板2 16GB现货' , '小米电视3S 48英寸','小米手机4c','小米盒子3 增强版' ,'小米手环 2' ,'小蚁智能摄像机 夜视版' ,'米家压力IH电饭煲'],
			detail : ['4GB内存+128GB闪存，陶瓷版' , '6.44英寸大屏，3GB内存+64GB容量' , '金属机身，指纹识别，超长待机' , '轻薄全金属，海量内容' , '原装液晶屏，金属机身，足量现货','快、轻薄、美，青春五色可选' , '高端 4K 网络机顶盒','每天早10点开售','能看能听能说，手机远程控制','用聪明的锅，做幸福的饭'],
			price : ['2699元' , '1699元' ,'699元起' ,'999元','1999元','1099元','399元','149元','149元','999元']
		},

		//match
		match:{
			hot:{
				title:["小米移动电源10000mAh","小米圈铁耳机","小米插线板","小米移动电源10000mAh 高配版","小米活塞耳机 基础版","小米蓝牙耳机","小米蓝牙音箱","小米小钢炮蓝牙音箱 青春版 象牙白"],
				price:["79","99","49","149","29","79","199","99"],
				comment:["19万人评价","1.2万人评价","24.5万人评价","1.9万人评价","5.1万人评价","8.7万人评价","1.9万人评价"],
				number:[5],
				review:["小米的产品值得信赖，用了一段时间，无论是听歌，打电话..."],
				author:["来自于 气功流 的评价"]
			},
			ear:{
				title:["小米活塞耳机 基础版","小米圈铁耳机","小米胶囊耳机","小米蓝牙耳机","小米小钢炮蓝牙音箱2","小米随身蓝牙音箱","小米蓝牙音箱","小米小钢炮蓝牙音箱 青春版"],
				price:["29","99","69","79","129","69","199","99"],
				comment:["5.1万人评价","1.1万人评价","1万人评价","8.7万人评价","1万人评价","7050人评价","1.8万人评价"],
				number:[0,1,2,3,4,5,6],
				review:["音质非常的好，很震撼！！美美美！","一上手就试试，音质还不错，煲机后会更好","很小巧 像不喜欢戴活塞的人可以试试这种~很舒服包装还...","1.非常好用，戴起来很舒适2.音质不错，比某些大品牌...","物流超快，包装一打开，我就闻到了一缕口红的清香，陶醉...","东西很小，做工挺精致，电池待机也比想象中好。值得买。","还可以插内存卡，可以插线播放，音质很棒，如果体积大点..."],
				author:["来自于 米米小米aa 的评价","来自于 张杰奇 的评价"," 来自于 鹤唳 的评价 ","来自于 什排地帅哥 的评价"," 来自于 588262758 的评价 "," 来自于 同路者 的评价 "," 来自于 422979039 的评价 "]
			},
			power:{
				title:["移动电源5000mAh","移动电源10000mAh","移动电源10000mAh 高配版","移动电源20000mAh","10000mAh小米移动电源保护套","小米插线板( 3孔位+USB )","小米USB充电器( 4口 )","小米插线板 5孔位"],
				price:["49","79","149","149","29","79","199","39"],
				comment:["8.6万人评价","18.9万人评价","1.9万人评价","4.5万人评价","2万人评价","24.4万人评价","6418万人评价"],
				number:[0,1,2,3,4,5,6],
				review:["(⊙o⊙)…呃。我敢说被人抢了么。这都第三个了。第一...","小米官方的电源没的说  特别是现在新改版的电源大小合...","很薄，充电快，方便携带","一如既往的好评！支持小米！","可好了，能有效的保护手机了，再也不用担心移动电源被磨...","3个usb插口正好给手机和pad充电，隐藏式白色指示...","挺不错哒小巧精致非常使用，支持快充"],
				author:[" 来自于 糖糖果果儿 的评价 "," 来自于 虾米吃咪咪 的评价 "," 来自于 CURGT丶FaKer 的评价 "," 来自于 小丹555 的评价 "," 来自于 682837881 的评价 "," 来自于 prinoac 的评价 "," 来自于 朋哥441035 的评价 "]
			},
			card:{
				title:["SanDisk 16GB储存卡( Class4 )","原装快充套装","彩虹5号电池( 10粒装 )","彩虹7号电池( 10粒装 )","CR2032纽扣电池","紫5镍氢充电电池","小米车载充电器","红米2/红米2A能量套装"],
				price:["35.9","58","9.9","9.9","9","49","49","69"],
				comment:["7.9万人评价","0人评价","6.7万人评价","3.8万人评价","1.3万人评价","2152人评价","2.8万人评价"],
				number:[0,2,3,4,5,6],
				review:["物美价廉，正品行货，发货迅速","价格实惠，外观好看，还有盒子便于保管，不错。","很漂亮的电池，好用不贵","小米把关，质量还是有得保证的，暂时还没用，先备着！","循环再利用，再也不用担心电池消耗快的问题了，想用就用...","精致漂亮非常喜欢，充电很快！"],
				author:[" 来自于 sharph 的评价 "," 来自于 monkeyshine 的评价 "," 来自于 叫我吐吐 的评价 "," 来自于 陶都 的评价 "," 来自于 比较低调的米粉 的评价 "," 来自于 灰心的人 的评价 "],
			},
			/*delNum:{
				ulth:[4],
				lith:[0,1],
				price:[49.9,78]
			},*/
			length:4,
			attr:["hot","ear","power","card"],
			tName:["热门","耳机音箱","电源","电池储存卡"]
		}
	}
})();
